---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalGeometryIsValid
source: html/23f15f60-1b0a-8bf7-454a-b07543a06f9a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalGeometryIsValid Property

"Analytical Model Correct"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalGeometryIsValid { get; }
```